{
  "header_home": "Home",
  "header_health": "Health & Fitness",
  "header_pregnancy": "Pregnancy & Family",
  "header_tools": "General Tools",
  "header_analytics": "Analytics",
  "settings_theme": "Theme",
  "settings_language": "Language",
  "theme_light": "Light",
  "theme_dark": "Dark",
  "dashboard_title": "Professional Online Calculators",
  "dashboard_subtitle": "Free, accurate, and easy-to-use calculators for health, pregnancy, and everyday tools. Get instant results with our comprehensive calculator suite.",
  "search_placeholder": "Search calculators...",
  "tools_count": "tools",
  "no_calculators_found": "No calculators found for",
  "back_to_dashboard": "Back to Dashboard",
  "calculator_not_found": "Calculator Not Found",
  "calculator_suffix": "Calculator",
  "error_loading_calculator": "Error loading calculator.",
  "footer_quick_links": "Quick Links",
  "footer_copyright": "© {{year}} Calcorda. All rights reserved. Made with ❤️ for better calculations.",
  "page_help": "Help",
  "page_feedback": "Send Feedback",
  "page_privacy": "Privacy Policy",
  "page_terms": "Terms of Service",
  "page_about": "About Us",
  "page_contact": "Contact",
  "page_cookie_policy": "Cookie Policy",
  "page_cookie_settings": "Cookie Settings",
  "about_us_title": "About Calcorda",
  "about_us_p1": "Calcorda is dedicated to providing free, accurate, and easy-to-use online calculators across various domains including health, finance, and general utilities.",
  "about_us_p2": "Our mission is to empower users by providing them with the tools they need to make informed decisions in their daily lives. All our tools are developed by experts and are rigorously tested to ensure accuracy and reliability.",
  "contact_us_title": "Contact Us",
  "contact_us_p1": "We'd love to hear from you! Whether you have a question, feedback, or a suggestion, please feel free to reach out.",
  "contact_form_name": "Your Name",
  "contact_form_email": "Your Email",
  "contact_form_message": "Your Message",
  "contact_form_submit": "Send Message",
  "optional": "optional",
  "privacy_policy_title": "Privacy Policy",
  "privacy_policy_p1": "Your privacy is important to us. This privacy statement explains the personal data Calcorda processes, how Calcorda processes it, and for what purposes.",
  "terms_of_service_title": "Terms of Service",
  "terms_of_service_p1": "By accessing or using the Calcorda website, you agree to be bound by these terms of service. If you disagree with any part of the terms, then you do not have permission to access the service.",
  "analytics_title": "Analytics Dashboard",
  "analytics_subtitle": "Real-time insights into calculator usage and performance.",
  "analytics_total_uses": "Total Uses",
  "analytics_active_users": "Active Users (24h)",
  "analytics_most_popular": "Most Popular",
  "analytics_usage_trends": "Usage Trends (Last 7 Days)",
  "analytics_popular_calcs": "Popular Calculators",
  "analytics_device_usage": "Device Usage",
  "page_help_title": "Help & FAQ",
  "help_intro": "Find answers to common questions about Calcorda. If you can't find what you're looking for, feel free to contact us.",
  "help_q1": "How do I use a calculator?",
  "help_a1": "Simply navigate to the calculator you wish to use from the dashboard. Enter the required information in the input fields and click the 'Calculate' button. Your results will be displayed instantly.",
  "help_q2": "Are the calculators accurate?",
  "help_a2": "Our calculators are built on standard, widely-accepted formulas and are rigorously tested. However, for medical or financial decisions, they should be used for informational purposes only and not as a substitute for professional advice.",
  "help_q3": "Is my data safe?",
  "help_a3": "Yes. All calculations are performed directly in your browser. We do not store any personal data you enter into the calculators. For more details, please see our Privacy Policy.",
  "help_q4": "How do I change the language or theme?",
  "help_a4": "Click the settings icon (cogwheel) in the top-right corner of the header. From there, you can switch between light and dark themes, and select your preferred language.",
  "page_feedback_title": "Send Feedback",
  "feedback_intro": "Your feedback is valuable to us. Please let us know how we can improve.",
  "feedback_type": "Feedback Type",
  "feedback_type_suggestion": "Suggestion",
  "feedback_type_bug": "Bug Report",
  "feedback_type_praise": "Praise",
  "feedback_submit": "Submit Feedback",
  "page_cookie_policy_title": "Cookie Policy",
  "cookie_policy_p1": "This page explains how we use cookies and similar technologies to help us ensure that our services function properly, prevent fraud and other harm, and analyze and improve the services in accordance with our Privacy Policy.",
  "cookie_policy_h1": "What are cookies?",
  "cookie_policy_p2": "Cookies are small text files that are stored on your computer or mobile device when you visit a website. They are widely used to make websites work or work more efficiently.",
  "cookie_policy_h2": "How we use cookies",
  "cookie_policy_p3": "We use a minimal number of cookies, primarily for essential functionality. We do not use third-party tracking or advertising cookies. The cookies we use are:",
  "cookie_policy_l1_strong": "Theme Preference:",
  "cookie_policy_l1_text": "We store your choice of light or dark mode so the site remembers your preference on your next visit.",
  "cookie_policy_l2_strong": "Language Preference:",
  "cookie_policy_l2_text": "We store your selected language to provide a consistent experience across the site.",
  "cookie_policy_h3": "Your Choices",
  "cookie_policy_p4": "Because we only use essential cookies for basic site functionality, we do not provide an option to disable them. However, you can manage and delete cookies through your browser settings. You can also manage your settings on our Cookie Settings page.",
  "page_cookie_settings_title": "Cookie Settings",
  "cookie_settings_intro": "Here you can manage your preferences for our site. We use local storage, a technology similar to cookies, to save your settings directly on your device.",
  "cookie_settings_h1": "Essential Site Preferences",
  "cookie_settings_p1": "We store the following settings to enhance your experience. These are not used for tracking.",
  "cookie_settings_l1": "Your preferred theme (Light/Dark Mode).",
  "cookie_settings_l2": "Your selected language (English/Arabic).",
  "cookie_settings_note": "These settings are essential for the site to function as you expect. Clearing them will reset the site to its default state.",
  "cookie_settings_button": "Clear My Settings & Reload",
  "cookie_settings_cleared": "Settings cleared. Reloading...",
  "calculator_bmi_name": "BMI Calculator",
  "calculator_bmi_desc": "Calculate your Body Mass Index to assess if your weight is healthy for your height.",
  "calculator_bmi_seo_title": "BMI Calculator – Free Online Body Mass Index Tool",
  "calculator_bmi_seo_desc": "Calculate your Body Mass Index (BMI) instantly with our free, accurate online tool. Understand your weight category and get insights for a healthier lifestyle on Calcorda.",
  "calculator_calories_name": "Calorie Calculator",
  "calculator_calories_desc": "Estimate daily calorie needs based on your activity level and fitness goals.",
  "calculator_calories_seo_title": "Daily Calorie Calculator – TDEE & BMR",
  "calculator_calories_seo_desc": "Estimate your daily calorie needs for weight loss, maintenance, or gain. Our calculator uses your BMR and activity level (TDEE) for accurate results.",
  "calculator_bmr_name": "BMR Calculator",
  "calculator_bmr_desc": "Calculate your Basal Metabolic Rate - the calories your body burns at rest.",
  "calculator_bmr_seo_title": "BMR Calculator – Basal Metabolic Rate Tool",
  "calculator_bmr_seo_desc": "Find out your Basal Metabolic Rate (BMR), the number of calories your body needs at rest, with our free and accurate BMR calculator.",
  "calculator_body_fat_name": "Body Fat Calculator",
  "calculator_body_fat_desc": "Estimate your body fat percentage using the US Navy method.",
  "calculator_body_fat_seo_title": "Body Fat Calculator – Estimate Your Body Fat %",
  "calculator_body_fat_seo_desc": "Use our free Body Fat Calculator to estimate your body fat percentage using your height, weight, and circumference measurements.",
  "calculator_macro_name": "Macro Calculator",
  "calculator_macro_desc": "Calculate optimal macronutrient distribution for your diet and fitness goals.",
  "calculator_macro_seo_title": "Macronutrient Calculator – Protein, Carbs, & Fat",
  "calculator_macro_seo_desc": "Calculate your optimal daily intake of protein, carbs, and fat based on your calorie goals and diet type (balanced, low-carb, high-protein).",
  "calculator_water_intake_name": "Water Intake Calculator",
  "calculator_water_intake_desc": "Calculate your daily water intake needs based on weight and activity.",
  "calculator_water_intake_seo_title": "Daily Water Intake Calculator",
  "calculator_water_intake_seo_desc": "How much water should you drink a day? Our calculator estimates your recommended daily water intake based on your weight and activity level.",
  "calculator_ideal_weight_name": "Ideal Weight Calculator",
  "calculator_ideal_weight_desc": "Find your ideal weight range using multiple scientific formulas.",
  "calculator_ideal_weight_seo_title": "Ideal Weight Calculator – Healthy Weight Range",
  "calculator_ideal_weight_seo_desc": "Determine your ideal healthy weight range based on your height and gender using several recognized formulas. Free and easy to use.",
  "calculator_heart_rate_name": "Heart Rate Calculator",
  "calculator_heart_rate_desc": "Calculate target heart rate zones for optimal workout intensity.",
  "calculator_heart_rate_seo_title": "Target Heart Rate Zone Calculator",
  "calculator_heart_rate_seo_desc": "Find your target heart rate zones for fat burn, cardio, and peak performance. Maximize your workout effectiveness with our free calculator.",
  "calculator_blood_pressure_name": "Blood Pressure Calculator",
  "calculator_blood_pressure_desc": "Analyze and categorize blood pressure readings according to medical guidelines.",
  "calculator_blood_pressure_seo_title": "Blood Pressure Reading Analyzer",
  "calculator_blood_pressure_seo_desc": "Enter your systolic and diastolic readings to instantly check your blood pressure category (Normal, Elevated, High) based on AHA guidelines.",
  "calculator_sleep_name": "Sleep Calculator",
  "calculator_sleep_desc": "Calculate optimal bedtime and wake time based on natural sleep cycles.",
  "calculator_sleep_seo_title": "Sleep Cycle Calculator – Find Your Perfect Bedtime",
  "calculator_sleep_seo_desc": "Wake up refreshed by calculating the best time to go to bed or wake up. Our sleep calculator is based on natural 90-minute sleep cycles.",
  "calculator_pregnancy_name": "Pregnancy Calculator",
  "calculator_pregnancy_desc": "Track pregnancy progress, estimate due date, and monitor important milestones.",
  "calculator_pregnancy_seo_title": "Pregnancy Progress & Due Date Calculator",
  "calculator_pregnancy_seo_desc": "Track your pregnancy week by week. Enter your last menstrual period to see your estimated due date, current progress, and trimester.",
  "calculator_due_date_name": "Due Date Calculator",
  "calculator_due_date_desc": "Calculate your estimated due date based on last menstrual period or conception date.",
  "calculator_due_date_seo_title": "Pregnancy Due Date Calculator",
  "calculator_due_date_seo_desc": "Estimate your baby's due date based on your last menstrual period (LMP) or date of conception. Includes key pregnancy milestones.",
  "calculator_ovulation_name": "Ovulation Calculator",
  "calculator_ovulation_desc": "Predict your most fertile days and ovulation date for family planning.",
  "calculator_ovulation_seo_title": "Ovulation & Fertile Window Calculator",
  "calculator_ovulation_seo_desc": "Pinpoint your most fertile days and estimated ovulation date with our free calculator. Ideal for family planning and trying to conceive.",
  "calculator_menstrual_cycle_name": "Menstrual Cycle Calculator",
  "calculator_menstrual_cycle_desc": "Track and predict menstrual cycle patterns and fertile windows.",
  "calculator_menstrual_cycle_seo_title": "Menstrual Cycle & Period Predictor",
  "calculator_menstrual_cycle_seo_desc": "Track your menstrual cycle and predict your next period and fertile window. A simple tool for understanding your cycle.",
  "calculator_baby_growth_name": "Baby Growth Percentile Calculator",
  "calculator_baby_growth_desc": "Track your baby's growth percentiles for height, weight, and head circumference.",
  "calculator_baby_growth_seo_title": "Baby Growth Chart & Percentile Calculator",
  "calculator_baby_growth_seo_desc": "Track your baby's development by calculating their weight, length, and head circumference percentiles based on WHO growth charts.",
  "calculator_age_name": "Age Calculator",
  "calculator_age_desc": "Calculate exact age in years, months, and days.",
  "calculator_age_seo_title": "Age Calculator – How Old Am I?",
  "calculator_age_seo_desc": "Calculate your exact age in years, months, and days from your date of birth. Find out how many days you've been alive.",
  "calculator_date_difference_name": "Date Difference Calculator",
  "calculator_date_difference_desc": "Calculate the difference between two dates in days.",
  "calculator_date_difference_seo_title": "Date Difference Calculator – Days Between Dates",
  "calculator_date_difference_seo_desc": "Easily calculate the number of days, weeks, or months between two dates with our free online date difference tool.",
  "calculator_baby_name_generator_name": "Baby Name Generator",
  "calculator_baby_name_generator_desc": "Generate unique and popular baby names based on your preferences.",
  "calculator_baby_name_generator_seo_title": "Baby Name Generator – Find the Perfect Name",
  "calculator_baby_name_generator_seo_desc": "Looking for the perfect name for your baby boy or girl? Use our generator to find unique, popular, and meaningful names.",
  "calculator_password_generator_name": "Password Generator",
  "calculator_password_generator_desc": "Generate strong, secure passwords with customizable criteria.",
  "calculator_password_generator_seo_title": "Secure Password Generator – Create Strong Passwords",
  "calculator_password_generator_seo_desc": "Create strong, random, and secure passwords with our free generator. Customize length and character types for maximum security.",
  "calculator_random_number_name": "Random Number Generator",
  "calculator_random_number_desc": "Generate random numbers within a specified range.",
  "calculator_random_number_seo_title": "Random Number Generator (RNG)",
  "calculator_random_number_seo_desc": "Generate one or more random numbers within a custom range (min and max). Simple, fast, and free to use.",
  "calculator_text_case_converter_name": "Text Case Converter",
  "calculator_text_case_converter_desc": "Convert text between different cases: uppercase, lowercase, title case, and more.",
  "calculator_text_case_converter_seo_title": "Text Case Converter Tool",
  "calculator_text_case_converter_seo_desc": "Easily convert text to UPPERCASE, lowercase, Title Case, or Sentence case with our free online case converter tool.",
  "calculator_word_counter_name": "Word Counter",
  "calculator_word_counter_desc": "Count words, characters, and paragraphs in your text.",
  "calculator_word_counter_seo_title": "Word & Character Count Tool",
  "calculator_word_counter_seo_desc": "Instantly count words, characters, sentences, and paragraphs in your text. A free and simple tool for writers, students, and professionals.",
  "calculator_character_counter_name": "Character Counter",
  "calculator_character_counter_desc": "Count characters and check limits for platforms like Twitter.",
  "calculator_character_counter_seo_title": "Character Counter – Online Letter Count Tool",
  "calculator_character_counter_seo_desc": "Count characters in your text instantly. Perfect for checking length limits for Twitter, SMS, or any other platform.",
  "calculator_currency_converter_name": "Currency Converter",
  "calculator_currency_converter_desc": "Convert amounts between hundreds of world currencies with mock exchange rates.",
  "calculator_currency_converter_seo_title": "Currency Converter – Exchange Rate Calculator",
  "calculator_currency_converter_seo_desc": "A simple and free currency converter tool that provides mock exchange rates for hundreds of world currencies. For demonstration purposes."
}
